{
  "Type": "Article",
  "Name": "Inheritance",
  "Information": "One of the most important concepts in object-oriented programming is that of inheritance. Inheritance allows us to define a class in terms of another class, which makes it easier to create and maintain an application. This also provides an opportunity to reuse the code functionality and fast implementation time.\n\nWhen creating a class, instead of writing completely new data members and member functions, the programmer can designate that the new class should inherit the members of an existing class. This existing class is called the base class, and the new class is referred to as the derived class.\n\nThe idea of inheritance implements the is a relationship. For example, mammal IS-A animal, dog IS-A mammal hence dog IS-A animal as well and so on.\n\nBase and Derived Classes\nA class can be derived from more than one classes, which means it can inherit data and functions from multiple base classes. To define a derived class, we use a class derivation list to specify the base class(es). A class derivation list names one or more base classes and has the form −\n\nclass derived-class: access-specifier base-class\nWhere access-specifier is one of public, protected, or private, and base-class is the name of a previously defined class. If the access-specifier is not used, then it is private by default.\n\nConsider a base class Shape and its derived class Rectangle as follows −\n\nLive Demo\n#include <iostream>\n \nusing namespace std;\n\n// Base class\nclass Shape {\n   public:\n      void setWidth(int w) {\n         width = w;\n      }\n      void setHeight(int h) {\n         height = h;\n      }\n      \n   protected:\n      int width;\n      int height;\n};\n\n// Derived class\nclass Rectangle: public Shape {\n   public:\n      int getArea() { \n         return (width * height); \n      }\n};\n\nint main(void) {\n   Rectangle Rect;\n \n   Rect.setWidth(5);\n   Rect.setHeight(7);\n\n   // Print the area of the object.\n   cout << \"Total area: \" << Rect.getArea() << endl;\n\n   return 0;\n}\nWhen the above code is compiled and executed, it produces the following result −\n\nTotal area: 35",
  "Difficulty": 1,
  "RelatedThemes": [
    "theme_OOP"
  ],
  "Links": [
    "https://www.w3schools.com/cpp/cpp_inheritance.asp",
    "https://www.geeksforgeeks.org/inheritance-in-c/"
  ],
  "Theme": [
    {
      "Name": "theme_Basic",
      "Weight": 0.8
    },
    {
      "Name": "theme_OOP",
      "Weight": 1.0
    }
  ],
  "DirectTasks": [
  ]
}
