{
  "Type": "Article",
  "Name": "Iterators",
  "Information": "An iterator is any object that, pointing to some element in a range of elements (such as an array or a container), has the ability to iterate through the elements of that range using a set of operators (with at least the increment (++) and dereference (*) operators).\n\nThe most obvious form of iterator is a pointer: A pointer can point to elements in an array, and can iterate through them using the increment operator (++). But other kinds of iterators are possible. For example, each container type (such as a list) has a specific iterator type designed to iterate through its elements.\n\nNotice that while a pointer is a form of iterator, not all iterators have the same functionality of pointers; Depending on the properties supported by iterators, they are classified into five different categories:\n\nIterator categories\nIterators are classified into five categories depending on the functionality they implement:\n\nInput\nOutput\nForward\nBidirectional\nRandom Access\n\nInput and output iterators are the most limited types of iterators: they can perform sequential single-pass input or output operations.\n\nForward iterators have all the functionality of input iterators and -if they are not constant iterators- also the functionality of output iterators, although they are limited to one direction in which to iterate through a range (forward). All standard containers support at least forward iterator types.\n\nBidirectional iterators are like forward iterators but can also be iterated through backwards.\n\nRandom-access iterators implement all the functionality of bidirectional iterators, and also have the ability to access ranges non-sequentially: distant elements can be accessed directly by applying an offset value to an iterator without iterating through all the elements in between. These iterators have a similar functionality to standard pointers (pointers are iterators of this category).",
  "Difficulty": 2,
  "RelatedThemes": [
    "theme_containers"
  ],
  "Links": [
    "https://www.geeksforgeeks.org/iterators-c-stl/",
    "https://en.cppreference.com/w/cpp/iterator/iterator"
  ],
  "Theme": [
    {
      "Name": "theme_containers",
      "Weight": 1.0
    }
  ],
  "DirectTasks": [
  ]
}
